src/cf/DataProcessors/уатПодборПакетовСопроводительныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>уатПодборПакетовСопроводительныхДокументов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/уатСтатусыСопроводительныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСтатусыСопроводительныхДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПунктОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПунктПрибытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПакетДокументов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПакетСопроводительныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СопроводительныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСопроводительныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/уатПакетСопроводительныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатПакетСопроводительныхДокументов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.уатСтатусыСопроводительныхДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОтправку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаПолучение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийПолучения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СопроводительныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СопроводительныйДокумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСопроводительныеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидУведомления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСпособыВзаимодействий_уэ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПолучателя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатТипыПолучателейУведомлений_уэ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПосылатьУведомления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DataProcessors/уатПодборПакетовСопроводительныхДокументов/Forms/ФормированиеПакетовДляОтправки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ответственный = ПользователиКлиентСервер.АвторизованныйПользователь();
	Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		Ответственный, "ОсновнаяОрганизация");
	СтруктураОбъектовНастроек = Новый Структура("Организация", Организация);
	ОтборМестоположение = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(
		СтруктураОбъектовНастроек, "ОсновнойПунктОтправления");
	
	Если НЕ ЗначениеЗаполнено(ОтборСтатус) Тогда
		ОтборСтатус = ПредопределенноеЗначение("Справочник.уатСтатусы_уэ.Новый");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьСД(Команда)
	Если Не ЗначениеЗаполнено(ОтборСтатус) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано значение отбора по статусу",, "ОтборСтатус");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОтборМестоположение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано значение отбора по местоположению",, "ОтборМестоположение");
		Возврат;
	КонецЕсли;
	
	ПодобратьДокументыСервер();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПакеты(Команда)
	мсвСозданныеПакеты = Неопределено;
	СоздатьПакетыСервер(мсвСозданныеПакеты);
	
	Для Каждого ТекПакет Из мсвСозданныеПакеты Цикл
		ПоказатьЗначение(Неопределено, ТекПакет);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	Для Каждого ТекСтрока Из ПакетыДокументов Цикл
		ТекСтрока.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого ТекСтрока Из ПакетыДокументов Цикл
		ТекСтрока.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужеюныеПроцедурыИФункции

&НаКлиенте
Процедура ПакетыДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ПакетыДокументовПакет" Тогда
		ТекПакет = Элементы.ПакетыДокументов.ТекущиеДанные.Пакет;
		Если ЗначениеЗаполнено(ТекПакет) Тогда
			ПоказатьЗначение(Неопределено, ТекПакет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПодобратьДокументыСервер()
	СопроводительныеДокументы.Очистить();
	ПакетыДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатСопроводительныеДокументыСрезПоследних.СопроводительныйДокумент,
	|	уатСопроводительныеДокументыСрезПоследних.СопроводительныйДокумент.ВладелецДокумента КАК ВладелецДокумента,
	|	уатСопроводительныеДокументыСрезПоследних.Организация,
	|	уатСопроводительныеДокументыСрезПоследних.Отправитель,
	|	уатСопроводительныеДокументыСрезПоследних.ПунктОтправления,
	|	уатСопроводительныеДокументыСрезПоследних.Получатель,
	|	уатСопроводительныеДокументыСрезПоследних.ПунктПрибытия,
	|	1 КАК Количество
	|ИЗ
	|	РегистрСведений.уатСтатусыСопроводительныхДокументов.СрезПоследних КАК уатСопроводительныеДокументыСрезПоследних
	|ГДЕ
	|	уатСопроводительныеДокументыСрезПоследних.Местоположение = &Местоположение
	|	И уатСопроводительныеДокументыСрезПоследних.Статус = &Статус";
	Запрос.УстановитьПараметр("Местоположение", ОтборМестоположение);
	Запрос.УстановитьПараметр("Статус", ОтборСтатус);
	тблСД = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из тблСД Цикл
		НоваяСтрока = СопроводительныеДокументы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	
	тблСДсвернутая = тблСД.Скопировать();
	тблСДсвернутая.Свернуть("ВладелецДокумента, Организация", "Количество");
	
	Для Каждого ТекСтрока Из тблСДсвернутая Цикл
		НоваяСтрока = ПакетыДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьПакетыСервер(мсвСозданныеПакеты = Неопределено)
	мсвСозданныеПакеты = Новый Массив;
	
	Для Каждого ТекСтрока Из ПакетыДокументов Цикл
		Если НЕ ТекСтрока.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрока.Пакет) Тогда
			ТекСтрока.Пометка = Ложь;
			Продолжить;
		КонецЕсли;
			
		СтруктураПоиска = Новый Структура("ВладелецДокумента, Организация", ТекСтрока.ВладелецДокумента, ТекСтрока.Организация);
		мсвСтрокиПоиска = СопроводительныеДокументы.НайтиСтроки(СтруктураПоиска);
		Если мсвСтрокиПоиска.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйПакет = Документы.уатПакетСопроводительныхДокументов.СоздатьДокумент();
		НовыйПакет.Дата = ТекущаяДата();
		НовыйПакет.УстановитьНовыйНомер();
		НовыйПакет.Организация = ТекСтрока.Организация;
		НовыйПакет.Отправлен = Истина;
		НовыйПакет.ДатаОтправления = НовыйПакет.Дата;
		НовыйПакет.ПунктОтправления = ОтборМестоположение;
		НовыйПакет.СтатусОтправления = СтатусОтправления;
		НовыйПакет.Ответственный = Ответственный;
		НовыйПакет.ОтветственныйЗаОтправку = Ответственный;
		НовыйПакет.Отправитель = Отправитель;
		НовыйПакет.Получатель = ТекСтрока.ВладелецДокумента;
		
		Для Каждого ТекДок Из мсвСтрокиПоиска Цикл
			НоваяСтрока = НовыйПакет.СопроводительныеДокументы.Добавить();
			НоваяСтрока.СопроводительныйДокумент = ТекДок.СопроводительныйДокумент;
		КонецЦикла;
		
		НовыйПакет.ОбменДанными.Загрузка = Истина;
		Попытка
			НовыйПакет.Записать(РежимЗаписиДокумента.Запись);
			ТекСтрока.Пакет = НовыйПакет.Ссылка;
			ТекСтрока.Пометка = Ложь;
			мсвСозданныеПакеты.Добавить(НовыйПакет.Ссылка);
		Исключение
			ТекстОшибки = СтрШаблон("Не удалось записать документ %1: %2", НовыйПакет, ИнформацияОбОшибке().Описание);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
